### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_scheduled_query_rules_alert_v2.bad-record-alert will be destroyed
  # (because azurerm_monitor_scheduled_query_rules_alert_v2.bad-record-alert is not in configuration)
  - resource "azurerm_monitor_scheduled_query_rules_alert_v2" "bad-record-alert" {
      - auto_mitigation_enabled                = false -> null
      - created_with_api_version               = "2023-03-15-preview" -> null
      - description                            = "The Expired Sessions Discoverer function found bad record(s) that may require attention." -> null
      - enabled                                = true -> null
      - evaluation_frequency                   = "P1D" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[AUTH | io-p-itn-auth-profas-func-02] Expired Sessions Discoverer found bad record(s)" -> null
      - is_a_legacy_log_analytics_rule         = false -> null
      - is_workspace_alerts_storage_configured = false -> null
      - location                               = "italynorth" -> null
      - name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Expired Sessions Discoverer found bad record(s)" -> null
      - resource_group_name                    = "io-p-itn-auth-main-rg-01" -> null
      - scopes                                 = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ] -> null
      - severity                               = 1 -> null
      - skip_query_validation                  = false -> null
      - tags                                   = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Auth&Identity"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        } -> null
      - target_resource_types                  = [] -> null
      - window_duration                        = "P1D" -> null
      - workspace_alerts_storage_enabled       = false -> null
        # (3 unchanged attributes hidden)

      - action {
          - action_groups     = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ] -> null
          - custom_properties = {} -> null
        }

      - criteria {
          - operator                = "GreaterThan" -> null
          - query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.expired-sessions-discoverer.permanent.bad-record"
            EOT -> null
          - threshold               = 0 -> null
          - time_aggregation_method = "Count" -> null
            # (2 unchanged attributes hidden)

          - failing_periods {
              - minimum_failing_periods_to_trigger_alert = 1 -> null
              - number_of_evaluation_periods             = 1 -> null
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.expired-sessions-discoverer-bad-record-alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "expired-sessions-discoverer-bad-record-alert" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "The Expired Sessions Discoverer function found bad record(s) that may require attention."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Expired Sessions Discoverer found bad record(s)"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.expired-sessions-discoverer.permanent.bad-record"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.expired-sessions-discoverer-max-retry-reached-alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "expired-sessions-discoverer-max-retry-reached-alert" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "The Expired Sessions Discoverer function reached the maximum number of retries"
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Expired Sessions Discoverer max retry reached"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.expired-sessions-discoverer.max-retry-reached"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.expired-sessions-discoverer-revert-failure-alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "expired-sessions-discoverer-revert-failure-alert" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Some notifications status reverts did not complete successfully"
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Expired Sessions Discoverer failed to revert a notification status"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.expired-sessions-discoverer.permanent.revert-failure"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.max-retry-reached-alert will be destroyed
  # (because azurerm_monitor_scheduled_query_rules_alert_v2.max-retry-reached-alert is not in configuration)
  - resource "azurerm_monitor_scheduled_query_rules_alert_v2" "max-retry-reached-alert" {
      - auto_mitigation_enabled                = false -> null
      - created_with_api_version               = "2023-03-15-preview" -> null
      - description                            = "The Expired Sessions Discoverer function reached the maximum number of retries" -> null
      - enabled                                = true -> null
      - evaluation_frequency                   = "P1D" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[AUTH | io-p-itn-auth-profas-func-02] Expired Sessions Discoverer max retry reached" -> null
      - is_a_legacy_log_analytics_rule         = false -> null
      - is_workspace_alerts_storage_configured = false -> null
      - location                               = "italynorth" -> null
      - name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Expired Sessions Discoverer max retry reached" -> null
      - resource_group_name                    = "io-p-itn-auth-main-rg-01" -> null
      - scopes                                 = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ] -> null
      - severity                               = 1 -> null
      - skip_query_validation                  = false -> null
      - tags                                   = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Auth&Identity"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        } -> null
      - target_resource_types                  = [] -> null
      - window_duration                        = "P1D" -> null
      - workspace_alerts_storage_enabled       = false -> null
        # (3 unchanged attributes hidden)

      - action {
          - action_groups     = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ] -> null
          - custom_properties = {} -> null
        }

      - criteria {
          - operator                = "GreaterThan" -> null
          - query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.expired-sessions-discoverer.max-retry-reached"
            EOT -> null
          - threshold               = 0 -> null
          - time_aggregation_method = "Count" -> null
            # (2 unchanged attributes hidden)

          - failing_periods {
              - minimum_failing_periods_to_trigger_alert = 1 -> null
              - number_of_evaluation_periods             = 1 -> null
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.revert-failure-alert will be destroyed
  # (because azurerm_monitor_scheduled_query_rules_alert_v2.revert-failure-alert is not in configuration)
  - resource "azurerm_monitor_scheduled_query_rules_alert_v2" "revert-failure-alert" {
      - auto_mitigation_enabled                = false -> null
      - created_with_api_version               = "2023-03-15-preview" -> null
      - description                            = "Some notifications status reverts did not complete successfully" -> null
      - enabled                                = true -> null
      - evaluation_frequency                   = "P1D" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[AUTH | io-p-itn-auth-profas-func-02] Failed to revert a notification status" -> null
      - is_a_legacy_log_analytics_rule         = false -> null
      - is_workspace_alerts_storage_configured = false -> null
      - location                               = "italynorth" -> null
      - name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Failed to revert a notification status" -> null
      - resource_group_name                    = "io-p-itn-auth-main-rg-01" -> null
      - scopes                                 = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ] -> null
      - severity                               = 1 -> null
      - skip_query_validation                  = false -> null
      - tags                                   = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Auth&Identity"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        } -> null
      - target_resource_types                  = [] -> null
      - window_duration                        = "P1D" -> null
      - workspace_alerts_storage_enabled       = false -> null
        # (3 unchanged attributes hidden)

      - action {
          - action_groups     = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ] -> null
          - custom_properties = {} -> null
        }

      - criteria {
          - operator                = "GreaterThan" -> null
          - query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.expired-sessions-discoverer.permanent.revert-failure"
            EOT -> null
          - threshold               = 0 -> null
          - time_aggregation_method = "Count" -> null
            # (2 unchanged attributes hidden)

          - failing_periods {
              - minimum_failing_periods_to_trigger_alert = 1 -> null
              - number_of_evaluation_periods             = 1 -> null
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.session-notification-events-processor-bad-message-alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "session-notification-events-processor-bad-message-alert" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "The Session Notification Events Processor function found bad message(s) while processing events."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Session Notification Events Processor found bad message(s)"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.session-notification-events-processor.permanent.bad-message"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.session-notification-events-processor-bad-record-alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "session-notification-events-processor-bad-record-alert" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "The Session Notification Events Processor function found bad record(s) that may require attention."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Session Notification Events Processor found bad record(s)"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.session-notification-events-processor.permanent.bad-record"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.session-notification-events-processor-max-retry-reached-alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "session-notification-events-processor-max-retry-reached-alert" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "The Session Notification Events Processor function reached the maximum number of retries"
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Session Notification Events Processor max retry reached"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.session-notification-events-processor.max-retry-reached"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.session-notification-events-processor-unable-to-build-new-record-alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "session-notification-events-processor-unable-to-build-new-record-alert" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "The Session Notification Events Processor function was not able to build a record."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH | io-p-itn-auth-profas-func-02] Session Notification Events Processor unable to build a record"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                customEvents
                | where name == "io.citizen-auth.prof-async.session-notification-events-processor.permanent.unable-to-build-new-record"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.function_lv.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02"
        name                                           = "io-p-itn-auth-lv-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 1 to change, 3 to destroy.
```

</details>
